{
  "backend/main.mo": "Motoko actor implementing complaint submission, storage, access control, lifecycle tracking, and priority scoring.",
  "feature_evidence.json": "Feature evidence report listing files and components changed for removing the term SLA from UI text.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Base HTML entry file mounting the app and loading main.tsx.",
  "frontend/README.md": "Setup guide describing prerequisites and installation steps for the frontend project.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, auth state, and layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component integrating Internet Identity auth.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Inactive modal for future user profile setup with basic form UI.",
  "frontend/src/components/complaints/BeforeAfterComparison.tsx": "Component displaying before/after complaint photos with status indicators.",
  "frontend/src/components/complaints/ComplaintMetaCard.tsx": "Card showing complaint metadata including priority, deadlines, dates, and reporter info.",
  "frontend/src/components/complaints/EscalationFlag.tsx": "Badge showing escalation status with relative timestamp.",
  "frontend/src/components/complaints/PhotoUploader.tsx": "Image uploader with preview, validation, and remove functionality that returns the selected file to a parent callback.",
  "frontend/src/components/complaints/PriorityScoreBadge.tsx": "Displays a priority badge with icon and color based on urgency level.",
  "frontend/src/components/complaints/SlaBadge.tsx": "Shows SLA status as overdue or time remaining, based on due date and complaint status.",
  "frontend/src/components/feedback/ResolutionFeedbackForm.tsx": "Form for confirming resolution, rating service, adding comments, and submitting feedback to the backend.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation links, mobile drawer, and footer, adapting links based on auth and admin status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks for fetching and mutating complaint data, including submission, status updates, and admin checks.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes with a civic‑focused color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/citizen/MyReportsPage.tsx": "Shows a user’s submitted complaints with loading, empty‑state, and detailed list views using badges and status indicators.",
  "frontend/src/pages/citizen/SubmitComplaintPage.tsx": "Provides a form for authenticated users to submit new complaints with category, location, description, and photo upload.",
  "frontend/src/pages/complaints/ComplaintDetailPage.tsx": "Displays full complaint details, including photos and admin actions, with support for status updates and after‑photo upload.",
  "frontend/src/pages/DocsPage.tsx": "Renders a documentation page showing prerequisites and step‑by‑step setup instructions for the project.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with hero content, feature steps, and links to start reporting or view docs.",
  "frontend/src/pages/official/HigherOfficialDashboardPage.tsx": "Shows escalated complaints to higher officials, gating access by admin role and listing complaint cards with priority and escalation info.",
  "frontend/src/pages/official/OfficialDashboardPage.tsx": "Renders the official dashboard with tabbed views for open and in‑progress complaints, including priority, deadline badges, and admin-gated access.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with sessionStorage fallback and hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, typography, queries, animations, and plugin setup.",
  "project_state.json": "Project metadata describing Civic Lens features, requirements, architecture notes, and current build state."
}