{
  "backend/main.mo": "Motoko actor managing citizen complaints with role-based access control, lifecycle fields, priority scoring, and storage integration.",
  "feature_evidence.json": "Lists feature evidence for removing footer branding, referencing affected frontend files and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base style layer defining OKLCH color variables and dark mode overrides.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/README.md": "Setup guide explaining prerequisites and steps for running the Civic Lens frontend.",
  "frontend/src/App.tsx": "Main React router configuration with authentication and password modal handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout control clearing identity, password verification, and query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for registering or verifying a password with validation and mutation calls.",
  "frontend/src/components/auth/ProfileSetupModal.types.ts": "Type definitions for password modal props and constants.",
  "frontend/src/components/auth/SignInOptions.tsx": "Sign‑in component offering Google and Apple login via Internet Identity wrapper.",
  "frontend/src/components/complaints/BeforeAfterComparison.tsx": "Displays before/after complaint photos with status-based badges and fallback when after photo is missing.",
  "frontend/src/components/complaints/ComplaintMetaCard.tsx": "Shows complaint metadata including priority, SLA, timestamps, location, and reporter info.",
  "frontend/src/components/complaints/EscalationFlag.tsx": "Renders a destructive badge indicating when a complaint was escalated with relative time.",
  "frontend/src/components/complaints/PhotoUploader.tsx": "Handles image upload with validation, preview display, and removal for complaint photo evidence.",
  "frontend/src/components/complaints/PriorityScoreBadge.tsx": "Shows a color-coded badge reflecting priority level based on urgency score.",
  "frontend/src/components/complaints/SlaBadge.tsx": "Displays SLA status, marking overdue items or showing remaining time until due.",
  "frontend/src/components/feedback/ResolutionFeedbackForm.tsx": "Allows users to confirm resolution and submit rating and comments for a complaint.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, authentication-aware links, and responsive mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, including login, logout, identity loading, and status management.",
  "frontend/src/hooks/usePasswordVerification.ts": "Hook managing session-based password verification with sync across tabs.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating complaint and user-role data via the actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query, identity provider, and rendering the root component.",
  "frontend/src/pages/citizen/MyReportsPage.tsx": "Citizen dashboard listing the user's submitted complaints with status, badges, and detail links.",
  "frontend/src/pages/citizen/SubmitComplaintPage.tsx": "Form page allowing authenticated citizens to submit civic complaints with category, description, location, and photo.",
  "frontend/src/pages/complaints/ComplaintDetailPage.tsx": "Displays complaint details, status, photos, and admin tools for updating status and uploading resolution photos.",
  "frontend/src/pages/DocsPage.tsx": "Documentation page outlining prerequisites and setup steps for running Civic Lens.",
  "frontend/src/pages/LandingPage.tsx": "Landing page presenting the app’s purpose, sign-in options, and feature overview.",
  "frontend/src/pages/official/HigherOfficialDashboardPage.tsx": "Shows escalated complaints to higher officials with priority and escalation details for review.",
  "frontend/src/pages/official/OfficialDashboardPage.tsx": "Dashboard for officials to manage open and in‑progress complaints with filtering and quick access to details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Defines the project’s current state, including Civic Lens requirements, architectural notes, existing features, constraints, and workflow rules such as deduplication and a 72‑hour deadline with escalation."
}