{
  "backend/main.mo": "Defines the main canister logic for managing complaints, including submission, retrieval, authorization checks, storage mixins, and priority scoring.",
  "backend/migration.mo": "Provides migration logic that adds an afterPhotoId field to existing complaints and transforms old actor state into the new format.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing their roles in authentication, complaint handling, UI components, and styling.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color system for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the root React application.",
  "frontend/README.md": "Setup guide explaining prerequisites and steps for running the Civic Lens frontend.",
  "frontend/src/App.tsx": "Configures routing, authentication state, password verification modal logic, and renders the root application layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling login state, logout flow, and password verification reset.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Password verification modal that submits a password and handles loading and validation errors.",
  "frontend/src/components/auth/ProfileSetupModal.types.ts": "Defines props for the ProfileSetupModal component.",
  "frontend/src/components/auth/SignInOptions.tsx": "Renders Google and Apple sign‑in buttons using Internet Identity login with loading handling and retry logic.",
  "frontend/src/components/complaints/BeforeAfterComparison.tsx": "Displays before/after complaint photos with loading, error states, and status‑based badges.",
  "frontend/src/components/complaints/ComplaintMetaCard.tsx": "Shows complaint metadata including priority, SLA, timestamps, location, and reporter info.",
  "frontend/src/components/complaints/EscalationFlag.tsx": "Displays an escalation badge showing how long ago a complaint was escalated.",
  "frontend/src/components/complaints/PhotoUploader.tsx": "Image uploader with preview, validation for file type/size, and remove functionality.",
  "frontend/src/components/complaints/PriorityScoreBadge.tsx": "Shows a priority badge with variant, icon, and label based on urgency level.",
  "frontend/src/components/complaints/SlaBadge.tsx": "Displays remaining SLA time or an overdue badge based on due date and status.",
  "frontend/src/components/feedback/ResolutionFeedbackForm.tsx": "Feedback form allowing users to confirm resolution, give a rating, and submit comments.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation, authentication state checks, and responsive menu handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading via Dfinity AuthClient.",
  "frontend/src/hooks/usePasswordVerification.ts": "Tracks password verification state in sessionStorage with sync across tabs.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend API calls (complaints, roles, submissions, status updates) using React Query and the actor instance.",
  "frontend/src/index.css": "Tailwind setup defining global styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/citizen/MyReportsPage.tsx": "Displays the user's submitted complaints with loading, empty, and list states, including status, priority, and navigation to details.",
  "frontend/src/pages/citizen/SubmitComplaintPage.tsx": "Provides a complaint submission form with authentication checks, photo upload, and mutation to create a new complaint.",
  "frontend/src/pages/complaints/ComplaintDetailPage.tsx": "Shows detailed complaint information with photos, admin status update actions, and support for after-photo uploads.",
  "frontend/src/pages/DocsPage.tsx": "Renders project documentation with prerequisites and setup steps using styled UI components.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showing hero content, sign‑in options, and a workflow overview for reporting civic issues.",
  "frontend/src/pages/official/HigherOfficialDashboardPage.tsx": "Lists escalated complaints for higher officials with permission checks and quick access to complaint details.",
  "frontend/src/pages/official/OfficialDashboardPage.tsx": "Admin dashboard for managing open and in‑progress complaints with tabbed filtering and SLA indicators.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters and session‑persisted parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing Civic Lens features, requirements, issues, and architectural notes for the civic‑issue reporting system."
}