{
  "backend/main.mo": "Motoko backend managing complaints with storage, authorization, lifecycle timestamps, and role-gated submission and retrieval.",
  "feature_evidence.json": "Metadata describing feature evidence, linked files, components, and test coverage for password flow changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend files including authentication, complaints, UI components, and dashboards.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH civic color palette and light/dark theme variables.",
  "frontend/index.html": "App entry HTML mounting the root element and loading the main TypeScript bundle.",
  "frontend/README.md": "Frontend setup instructions covering prerequisites and steps to run the Civic Lens app.",
  "frontend/src/App.tsx": "Root app configuring routes and showing password verification modal only when a user has a stored password and isn't yet verified.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout control that clears session and password verification state on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting users with existing passwords to verify them before continuing.",
  "frontend/src/components/auth/ProfileSetupModal.types.ts": "Type definitions for the password verification modal props.",
  "frontend/src/components/auth/SignInOptions.tsx": "Google/Apple sign‑in buttons using Internet Identity login handling retries and loading states.",
  "frontend/src/components/complaints/BeforeAfterComparison.tsx": "Displays before and after complaint photos with status‑based badges and fallback when no after photo exists.",
  "frontend/src/components/complaints/ComplaintMetaCard.tsx": "Shows detailed complaint metadata including priority, SLA, timestamps, location, and reporter info.",
  "frontend/src/components/complaints/EscalationFlag.tsx": "Renders a destructive badge showing how long ago a complaint was escalated.",
  "frontend/src/components/complaints/PhotoUploader.tsx": "Handles image upload with validation, preview rendering, and removal for complaint photo evidence.",
  "frontend/src/components/complaints/PriorityScoreBadge.tsx": "Displays a badge indicating complaint priority level with icons based on urgency.",
  "frontend/src/components/complaints/SlaBadge.tsx": "Shows remaining time or overdue status for a complaint's SLA deadline.",
  "frontend/src/components/feedback/ResolutionFeedbackForm.tsx": "Form for submitting resolution feedback including confirmation, rating, comments, and mutation handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout with navigation links, authentication checks, admin routes, and mobile menu via sheet.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and authentication status management.",
  "frontend/src/hooks/usePasswordVerification.ts": "Hook managing password verification state via sessionStorage with cross-tab sync.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user roles, complaints, and complaint mutations.",
  "frontend/src/index.css": "Tailwind CSS base styles with custom light/dark civic-themed design tokens.",
  "frontend/src/main.tsx": "Application entry that mounts React, sets up React Query, and provides Internet Identity context.",
  "frontend/src/pages/citizen/MyReportsPage.tsx": "Citizen dashboard showing open complaints with badges, details, and links to view each report.",
  "frontend/src/pages/citizen/SubmitComplaintPage.tsx": "Form page for authenticated citizens to submit new complaints with category, description, location, and photo upload.",
  "frontend/src/pages/complaints/ComplaintDetailPage.tsx": "Displays detailed complaint info and allows admins to update status, upload after-photos, and manage resolution.",
  "frontend/src/pages/DocsPage.tsx": "Documentation page detailing prerequisites and setup steps for running Civic Lens.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, sign-in options, and explanation of the reporting process.",
  "frontend/src/pages/official/HigherOfficialDashboardPage.tsx": "Dashboard for higher officials to review and access escalated complaints beyond the response window.",
  "frontend/src/pages/official/OfficialDashboardPage.tsx": "Admin dashboard showing open and in‑progress complaints with filtering tabs and quick access to manage each case.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, typography, animations, and layout settings.",
  "project_state.json": "Describes the Civic Lens project state, including workflow requirements like deadlines, escalation, deduplication, authentication limits, and feature list with current implementation status."
}