{
  "backend/main.mo": "Motoko canister implementing complaint submission, storage, access control, and prioritization logic with role checks and lifecycle metadata.",
  "feature_evidence.json": "Feature evidence report mapping feature removals to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining a custom OKLCH color palette and theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/README.md": "Setup guide outlining prerequisites and step‑by‑step instructions for running the Civic Lens frontend.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, identity handling, user role loading, and theming.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button component integrating Internet Identity with loading and error handling states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Inactive modal component for collecting a user's name during initial profile setup.",
  "frontend/src/components/complaints/BeforeAfterComparison.tsx": "Displays before and after photos for a complaint with status‑based badges and pending placeholders.",
  "frontend/src/components/complaints/ComplaintMetaCard.tsx": "Metadata card showing complaint priority, deadline badge, timestamps, location, and reporter info.",
  "frontend/src/components/complaints/EscalationFlag.tsx": "Displays a destructive badge showing how long ago a complaint was escalated.",
  "frontend/src/components/complaints/PhotoUploader.tsx": "Handles image upload with preview, validation, and removal for complaint submissions.",
  "frontend/src/components/complaints/PriorityScoreBadge.tsx": "Renders a priority badge with icon and label based on urgency score.",
  "frontend/src/components/complaints/SlaBadge.tsx": "Shows SLA time remaining or an overdue badge depending on due date and status.",
  "frontend/src/components/feedback/ResolutionFeedbackForm.tsx": "Form allowing users to confirm resolution, give a rating, and submit feedback for a complaint.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with navigation links, auth handling, header, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading identities, login flow, and context state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating complaints, user roles, and statuses via the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/pages/citizen/MyReportsPage.tsx": "Displays a citizen’s submitted complaints with status, priority, and navigation to details.",
  "frontend/src/pages/citizen/SubmitComplaintPage.tsx": "Form for authenticated users to submit a new civic complaint with photo upload.",
  "frontend/src/pages/complaints/ComplaintDetailPage.tsx": "Shows full complaint details with admin status update actions, photos, and metadata.",
  "frontend/src/pages/DocsPage.tsx": "Documentation page showing prerequisites and setup steps for running the project.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page explaining the app and showing calls to action based on authentication.",
  "frontend/src/pages/official/HigherOfficialDashboardPage.tsx": "Displays escalated complaints for higher officials, handling admin checks, loading states, and rendering complaint cards with priority and escalation info.",
  "frontend/src/pages/official/OfficialDashboardPage.tsx": "Renders the official dashboard with tabs for open and in‑progress complaints, including admin validation, loading handling, and complaint management links.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading URL parameters, persisting them in sessionStorage, and cleaning parameters from URL hashes.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, feature list, architectural notes, and overall Civic Lens build status."
}