{
  "backend/main.mo": "Motoko canister managing complaint submission, storage, role‑based access, and priority/scoring logic.",
  "feature_evidence.json": "Feature evidence report mapping authentication‑UI and landing‑page updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Index of short summaries for all major frontend files including routing, authentication UI, complaint pages, and components.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions using custom OKLCH civic color palette.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main entry script.",
  "frontend/README.md": "Setup guide explaining prerequisites and steps to run the Civic Lens frontend project.",
  "frontend/src/App.tsx": "Main React app configuring router, routes, auth/state hooks, layout wrapper, and theme provider.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth control showing logout when signed in or Google/Apple sign‑in options when logged out.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Placeholder modal for initial user profile setup after authentication.",
  "frontend/src/components/auth/SignInOptions.tsx": "Google/Apple sign‑in buttons wired to Internet Identity login logic with loading and retry handling.",
  "frontend/src/components/complaints/BeforeAfterComparison.tsx": "Component displaying before/after complaint photos with status‑based badges and pending fallback.",
  "frontend/src/components/complaints/ComplaintMetaCard.tsx": "Displays key complaint metadata including priority, SLA, timestamps, location, and reporter using various badges and formatted dates.",
  "frontend/src/components/complaints/EscalationFlag.tsx": "Shows a destructive badge indicating when a complaint was escalated, formatted as time ago.",
  "frontend/src/components/complaints/PhotoUploader.tsx": "Handles image upload with validation, preview display, and removal, notifying parent via callback.",
  "frontend/src/components/complaints/PriorityScoreBadge.tsx": "Renders a priority badge with icon and label based on urgency level.",
  "frontend/src/components/complaints/SlaBadge.tsx": "Displays SLA status, showing overdue or remaining time based on due date and complaint status.",
  "frontend/src/components/feedback/ResolutionFeedbackForm.tsx": "Form for submitting resolution feedback including confirmation, rating, comments, and mutation handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout with navigation, auth-aware links, responsive menu, and header/footer structure.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, authentication management, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating complaint data through an actor, including submission, status updates, and role checks.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode styling, and utility classes.",
  "frontend/src/main.tsx": "App entry point that initializes React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/citizen/MyReportsPage.tsx": "Displays a citizen’s submitted complaints with status, priority, and navigation to detailed views.",
  "frontend/src/pages/citizen/SubmitComplaintPage.tsx": "Form page allowing authenticated users to submit a new complaint with category, description, location, and photo.",
  "frontend/src/pages/complaints/ComplaintDetailPage.tsx": "Displays a detailed view of a single complaint with status updates, before/after photos, and admin-only resolution actions.",
  "frontend/src/pages/DocsPage.tsx": "Documentation page showing project prerequisites and setup steps using styled cards and alerts.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, sign-in options, and explanation of how the civic reporting process works.",
  "frontend/src/pages/official/HigherOfficialDashboardPage.tsx": "Shows escalated complaints to higher officials with priority and escalation indicators, gated by admin access.",
  "frontend/src/pages/official/OfficialDashboardPage.tsx": "Provides officials with tabbed lists of open and in‑progress complaints, each showing priority and deadline info.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read, store, retrieve, and clear URL or session‑persisted parameters including hash‑based routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining themes, colors, animations, and plugin setup for the frontend.",
  "project_state.json": "Project metadata describing current features, architecture notes, requirements, and versioned state."
}