{
  "kind": "build_request",
  "title": "Restrict login UI to Google or Apple options",
  "projectName": "Civic Lens",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Update the authentication UI so the only visible sign-in options are \"Continue with Google\" and \"Continue with Apple\" (no generic \"Login\" button or any other provider options), while keeping the existing Internet Identity-based authentication flow behind the scenes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "People can login only through the Google account or or Apple account . Make this changes"
        ]
      },
      "acceptanceCriteria": [
        "When the user is logged out, the header/auth area shows exactly two sign-in buttons/options labeled \"Continue with Google\" and \"Continue with Apple\".",
        "Clicking either \"Continue with Google\" or \"Continue with Apple\" initiates the existing login flow successfully (same behavior as current login).",
        "No other sign-in method labels or UI entry points are shown anywhere in the app UI (e.g., no \"Login\" or \"Sign in\" generic button).",
        "When the user is logged in, the UI shows a logout control as it does today and does not show the Google/Apple sign-in buttons."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Update public landing page calls-to-action for unauthenticated users to align with the restricted sign-in options by replacing generic unauthenticated buttons (e.g., \"Get Started\", \"Sign In to Get Started\") with a clear prompt to sign in using Google or Apple and a direct interaction that opens the new Google/Apple sign-in choices.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "People can login only through the Google account or or Apple account . Make this changes"
        ]
      },
      "acceptanceCriteria": [
        "On the landing page, unauthenticated primary CTAs no longer use generic login wording; they direct users to continue with Google or Apple.",
        "The landing page provides a way to trigger the same Google/Apple sign-in choice UI used in the header (consistent behavior and wording).",
        "All new/updated user-facing text is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit immutable frontend files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui/* must remain unchanged.",
    "Authentication must continue to use the existing Internet Identity integration (no direct Google OAuth / Apple Sign-In integrations)."
  ],
  "nonGoals": [
    "Implementing real Google OAuth or Apple Sign-In (OIDC) integration.",
    "Changing backend authentication/authorization logic or user role handling.",
    "Adding new identity providers beyond the existing Internet Identity flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}