{
  "kind": "build_request",
  "title": "Fix photo upload so complaint images persist and display correctly",
  "projectName": "Civic Lens",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Implement persistent photo storage in the Motoko backend so uploaded complaint photos are stored in-canister (not as frontend-only blob/object URLs) and can be retrieved later for display.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Why I am not able to upload photos please fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a stable way to store an uploaded image (bytes + content type) and returns a persistent photo identifier.",
        "Backend exposes a way to retrieve an image by identifier (bytes + content type), suitable for rendering in the frontend.",
        "Stored photos remain available after page refresh and after navigating away/back to dashboards and detail pages."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Update complaint creation so the citizen \"before\" photo is actually uploaded/stored using the backend photo storage, and only then the complaint is created referencing the persistent photo identifier (instead of using URL.createObjectURL).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Why I am not able to upload photos please fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "Submitting a complaint with a valid image results in a complaint whose stored photo identifier can be used to fetch/display the image later.",
        "After submitting a complaint, the citizen can open the complaint detail page and see the before photo displayed correctly after a full page refresh.",
        "If photo upload/storage fails, the UI shows a clear English error message and does not create the complaint."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Fix photo rendering across the UI by replacing any direct <img src={photoId}> usage that assumes photoId is a browser blob/object URL, so that complaint photos are rendered from backend-stored photo data (before photo and, when available, after photo).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Why I am not able to upload photos please fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "Complaint detail page renders the before photo using backend-backed retrieval (not a transient object URL).",
        "Citizen and official dashboards/pages that display complaint photos (where applicable) no longer break after refresh/navigation due to invalid blob URLs.",
        "When a photo cannot be loaded, the UI shows a non-crashing fallback state and an English error toast/message."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Add backend and frontend support for uploading and persisting the official \"after\" photo when resolving a complaint, and store a persistent after-photo identifier on the complaint so before/after comparison can display both images after refresh.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Why I am not able to upload photos please fix this issue"
        ]
      },
      "acceptanceCriteria": [
        "When an official uploads an after photo and marks a complaint Resolved, the after photo is persisted and associated with the complaint in the backend.",
        "After marking Resolved, the complaint detail page shows both before and after photos correctly after a full page refresh.",
        "If the project already has live state, any required backend state/schema change is handled via a conditional migration (only if needed)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not modify files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding external/off-chain storage providers for images (e.g., S3, Firebase).",
    "Implementing real-time photo upload progress via WebSockets or push notifications.",
    "Changing authentication providers beyond the existing Internet Identity flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}