{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Persist and correctly render complaint photos using backend-backed storage",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Upload and persist the citizen \"before\" photo via backend storage before submitting a complaint, and submit the complaint referencing the persistent photo identifier.",
      "acceptanceCriteria": [
        "Submitting a complaint with a valid image results in a complaint whose stored photo identifier can be used to fetch/display the image later.",
        "After submitting a complaint, the citizen can open the complaint detail page and see the before photo displayed correctly after a full page refresh.",
        "If photo upload/storage fails, the UI shows a clear English error message and does not create the complaint."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useSubmitComplaint to stop using URL.createObjectURL; instead generate a persistent photo identifier, convert the File to bytes, use the blob-storage ExternalBlob (ExternalBlob.fromBytes) to call the backend storage capability (actor.storePhoto), and only after successful storage call actor.submitComplaint with the persistent photoId. Ensure failures show an English error and prevent complaint submission. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align frontend typings with the backend photo storage/retrieval contract used by the updated complaint submit flow (e.g., ensure the actor interface and ExternalBlob types reflect the photo storage capability that the frontend calls)."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Render complaint photos using backend-backed retrieval (not transient blob/object URLs) across complaint detail and any other views that display complaint photos.",
      "acceptanceCriteria": [
        "Complaint detail page renders the before photo using backend-backed retrieval (not a transient object URL).",
        "Citizen and official dashboards/pages that display complaint photos (where applicable) no longer break after refresh/navigation due to invalid blob URLs.",
        "When a photo cannot be loaded, the UI shows a non-crashing fallback state and an English error toast/message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/complaints/BeforeAfterComparison.tsx",
          "operation": "modify",
          "description": "Replace direct <img src={photoId}> rendering with backend-backed retrieval: use the blob-storage ExternalBlob returned from backend fetch calls and render via ExternalBlob.getDirectURL (or equivalent safe URL creation), with a non-crashing fallback UI when unavailable. Add English error handling/toast on load failures. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/complaints/ComplaintDetailPage.tsx",
          "operation": "modify",
          "description": "Wire BeforeAfterComparison to receive and display both before and after identifiers from the complaint (pass afterPhotoId when present). Ensure the detail view does not assume photoId is directly renderable as an <img> src."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query helpers for retrieving complaint photos as renderable URLs (e.g., fetch before/after ExternalBlob from backend and expose getDirectURL), including error mapping to English messages that the UI can display. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Support uploading and persisting the official \"after\" photo when resolving a complaint, and display before/after photos correctly after refresh.",
      "acceptanceCriteria": [
        "When an official uploads an after photo and marks a complaint Resolved, the after photo is persisted and associated with the complaint in the backend.",
        "After marking Resolved, the complaint detail page shows both before and after photos correctly after a full page refresh.",
        "If the project already has live state, any required backend state/schema change is handled via a conditional migration (only if needed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useUpdateComplaintStatus to, when resolving with an after photo, generate a persistent after-photo identifier, wrap bytes using blob-storage ExternalBlob (ExternalBlob.fromBytes), call the backend association/storage capability (actor.storeAfterPhoto) and only then call actor.updateStatus. Ensure that if storage fails, the UI surfaces a clear English error and does not mark the complaint resolved. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/complaints/ComplaintDetailPage.tsx",
          "operation": "modify",
          "description": "Keep the resolve flow gated on selecting an after photo, and rely on the updated mutation to persist it. Ensure post-resolution UI refresh shows both before and after images by passing complaint.afterPhotoId to the comparison component and relying on backend-backed rendering."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Ensure frontend actor typings include the after-photo persistence and retrieval capabilities used by the resolve flow (including the ExternalBlob-based methods), matching backend changes required for persistent after-photo identifiers."
        }
      ]
    }
  ]
}