{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Docs and Learn More sections from UI/navigation",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Remove the Docs link from the primary header navigation and mobile drawer navigation.",
      "acceptanceCriteria": [
        "The header navigation no longer contains a link labeled \"Docs\".",
        "The mobile navigation drawer no longer contains a link labeled \"Docs\".",
        "No other navigation links (Home, Report Issue, My Reports, Official Dashboard, Escalated Issues) are removed or renamed as part of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Remove the \"Docs\" nav item (the Link to \"/docs\") from the shared NavLinks block so it disappears from both the desktop header navigation and the mobile Sheet/drawer navigation, without changing any other existing nav links."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Remove the Learn More CTA/link from the landing page hero so it no longer routes users to docs.",
      "acceptanceCriteria": [
        "The landing page hero no longer shows a button/link labeled \"Learn More\".",
        "The remaining primary CTA in the hero (e.g., \"Report an Issue\" when authenticated or \"Get Started\" when not authenticated) still renders and works."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Remove the hero-area secondary CTA Button/Link that points to \"/docs\" and is labeled \"Learn More\", leaving the primary CTA logic and layout intact."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Remove the /docs route registration so documentation is no longer reachable through in-app routing.",
      "acceptanceCriteria": [
        "The router no longer registers a route at path \"/docs\".",
        "Navigating to \"/docs\" does not render the documentation content page (e.g., it should not resolve to the DocsPage component)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the docs route definition (createRoute with path \"/docs\"), remove its inclusion from the route tree, and remove the DocsPage import so the router no longer registers \"/docs\" and cannot resolve it to DocsPage."
        }
      ]
    }
  ]
}